app/views/messages/_side_bar.html.haml

  .group
    - current_user.groups.each do |group|
      .group__box
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 3