app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('saru', '2019-12-12 06:33:44', '2019-12-12 06:33:44')